# Import and Export Files

# Challenge 0 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [3]:
# your code here

from sqlalchemy import create_engine
import pandas as pd

host="localhost"
port=3306
dbname="sakila"
user="root"
password="1234"


engine = create_engine('mysql+mysqlconnector://{0}:{1}@{2}/{3}'.format(user, password,host, dbname)).connect()

In [11]:
query = pd.read_sql_query("""SELECT fact.title, fact.release_year, fact.rating, cat.name, fact.first_name, fact.last_name, fact.film_id
FROM
(SELECT f.title, f.release_year, f.rating, fact.first_name, fact.last_name, fact.film_id
FROM
(SELECT act.first_name, act.last_name, act.actor_id, fa.film_id
FROM actor act
JOIN film_actor fa
ON act.actor_id = fa.actor_id) AS fact
JOIN film f
ON fact.film_id = f.film_id) AS fact
JOIN
(SELECT cat.category_id, film.film_id, cat.name
FROM category cat
JOIN film_category film
ON cat.category_id = film.category_id) AS cat 
ON fact.film_id = cat.film_id;""", engine)
film_general = query

In [9]:
query = pd.read_sql_query("""SELECT rental_info.last_name, rental_info.rental_date, rental_info.return_date, rental_info.address, flm.title, rental_info.film_id
FROM
(SELECT rental_store.last_name, rental_store.rental_date, rental_store.return_date, rental_store.film_id, addr.address
FROM
(SELECT rental.last_name, rental.rental_date, rental.return_date, rental.film_id, str.store_id, str.address_id
FROM
(SELECT rtl.last_name, rtl.rental_date, rtl.return_date, ivt.film_id, ivt.store_id
FROM
(SELECT cst.last_name, rtl.rental_date, rtl.return_date, rtl.inventory_id
FROM customer cst
JOIN rental rtl
ON cst.customer_id = rtl.customer_id) AS rtl
JOIN inventory ivt
ON rtl.inventory_id = ivt.inventory_id) AS rental
JOIN store str
ON rental.store_id = str.store_id) AS rental_store
JOIN address addr
ON rental_store.address_id = addr.address_id) AS rental_info
JOIN film flm
ON rental_info.film_id = flm.film_id;""", engine)
rental_data = query

In [12]:
film_general.head()

          title  release_year rating    name first_name     last_name  film_id
0  AMADEUS HOLY          2006     PG  Action     JOHNNY  LOLLOBRIGIDA       19
1  AMADEUS HOLY          2006     PG  Action      JULIA       MCQUEEN       19
2  AMADEUS HOLY          2006     PG  Action        VAL        BOLGER       19
3  AMADEUS HOLY          2006     PG  Action       KIRK      JOVOVICH       19
4  AMADEUS HOLY          2006     PG  Action      JAMES          PITT       19

In [10]:
rental_data

,last_name,rental_date,return_date,address,title,film_id
0,HUNTER,2005-05-24 22:53:30,2005-05-26 22:04:30,47 MySakila Drive,BLANKET BEVERLY,80
1,COLLAZO,2005-05-24 22:54:33,2005-05-28 19:40:33,28 MySQL Boulevard,FREAKY POCUS,333
2,MURRELL,2005-05-24 23:03:39,2005-06-01 22:12:39,28 MySQL Boulevard,GRADUATE LORD,373
3,PURDY,2005-05-24 23:04:41,2005-06-03 01:43:41,47 MySakila Drive,LOVE SUICIDES,535
4,HANSEN,2005-05-24 23:05:21,2005-06-02 04:33:21,28 MySQL Boulevard,IDOLS SNATCHERS,450
...,...,...,...,...,...,...
16039,WHITE,2005-08-23 22:25:26,2005-08-25 23:54:26,47 MySakila Drive,COMANCHEROS ENEMY,168
16040,KELLY,2005-08-23 22:26:47,2005-08-27 18:02:47,28 MySQL Boulevard,VOYAGE LEGALLY,951
16041,ELLIS,2005-08-23 22:42:48,2005-08-25 02:48:48,28 MySQL Boulevard,ILLUSION AMELIE,452
16042,HAMILTON,2005-08-23 22:43:07,2005-08-31 21:33:07,47 MySakila Drive,HUNCHBACK IMPOSSIBLE,439
16043,CAUSEY,2005-08-23 22:50:12,2005-08-30 01:01:12,28 MySQL Boulevard,MOB DUFFEL,585

# Challenge 1 - Working with JSON files
Import the pandas library.

In [ ]:
# your code here

import pandas as pd

In the next cell, load the data in nasa.json in the data folder and load it into a pandas dataframe. Name the dataframe nasa.

In [13]:
# your code here

nasa = pd.read_json('nasa.json')

Now that we have loaded the data, let's examine it using the head() function.

In [14]:
# your code here

nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

####  The value_counts() function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the value_counts() function to determine the frequency of all types of asteroid landings by applying the function to the fall column.

In [15]:
# your code here

nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the orient=records argument and name the file nasa-output.json. Remember to save the file inside the data folder.

In [17]:
# your code here

nasa.to_json(r'C:\\Users\\DELL\\Desktop\\LABS\\lab-import-export\\your-code\\nasa-output.json')

# Challenge 2 - Working with CSV and Other Separated Files

Import the pandas library

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [1]:
#Your pandas import here:

import pandas as pd

In [18]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [19]:
# Your code here:

shuttle = pd.read_csv(tst_url, names=cols, sep=' ')

Let's verify that this worked by looking at the `head()` function.

In [20]:
# Your code here:

shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [21]:
# Your code here:

shuttle.to_csv(r'C:\\Users\\DELL\\Desktop\\LABS\\lab-import-export\\your-code\\shuttle.csv', sep=',', index_label=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [22]:
# Your code here:

import xlrd

astronaut = pd.read_excel('astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [23]:
# Your code here:

astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [24]:
# Your code here:

astronaut.value_counts('Undergraduate Major')

Undergraduate Major
Physics                           35
Aerospace Engineering             33
Mechanical Engineering            30
Aeronautical Engineering          28
Electrical Engineering            23
                                  ..
Earth Sciences                     1
Earth & Planetary Science          1
Music                              1
Computer & Systems Engineering     1
Accounting                         1
Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [25]:
# Your code here:

astronaut.to_csv(r'C:\\Users\\DELL\\Desktop\\LABS\\lab-import-export\\your-code\\astronaut.csv', sep=',', index_label=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [15]:
# Your code here: